БПКР/src/Catalogs/ПравилаРегулярныхРеализацийТоваровУслуг/ПравилаРегулярныхРеализацийТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаРегулярныхРеализацийТоваровУслуг</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/InformationRegisters/РегулярныеРеализацииТоваровУслуг/РегулярныеРеализацииТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегулярныеРеализацииТоваровУслуг</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </resources>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.ПравилаРегулярныхРеализацийТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Catalogs/ПравилаРегулярныхРеализацийТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Выполняется Тогда
		Возврат;
	КонецЕсли;
	
	Шаблон = Неопределено;
	ДатаСледующего = Неопределено;
	
	Если НЕ ДополнительныеСвойства.Свойство("Шаблон", Шаблон)
		Или НЕ ДополнительныеСвойства.Свойство("ДатаСледующего", ДатаСледующего) Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацияШаблон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шаблон, "Организация");
	
	Если Организация <> ОрганизацияШаблон Тогда
		Организация = ОрганизацияШаблон;
	КонецЕсли;
	
	РегистрыСведений.РегулярныеРеализацииТоваровУслуг.УстановитьШаблон(Ссылка, Шаблон, ДатаСледующего);
	
КонецПроцедуры

#КонецЕсли
